# Movies Dataset Data Cleaning -  Project

#### __Get__ imports, set pandas display options.

In [541]:
import numpy as np
import pandas as pd

In [542]:
pd.options.display.max_columns = 20
pd.options.display.float_format = '{:.2f}'.format

#### __Load__ and __inspect__ the messy dataset.

In [543]:
df = pd.read_csv('movies_metadata.csv', low_memory = False)

In [544]:
df.head()

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.00,81.00,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.70,5415.00
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.00,104.00,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.90,2413.00
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0.00,101.00,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.50,92.00
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,1995-12-22,81452156.00,127.00,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.10,34.00
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,1995-02-10,76578911.00,106.00,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.70,173.00

In [545]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 24 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   adult                  45466 non-null  object
 1   belongs_to_collection  4494 non-null   object
 2   budget                 45466 non-null  object
 3   genres                 45466 non-null  object
 4   homepage               7782 non-null   object
 5   id                     45466 non-null  object
 6   imdb_id                45449 non-null  object
 7   original_language      45455 non-null  object
 8   original_title         45466 non-null  object
 9   overview               44512 non-null  object
 10  popularity             45461 non-null  object
 11  poster_path            45080 non-null  object
 12  production_companies   45463 non-null  object
 13  production_countries   45463 non-null  object
 14  release_date           45379 non-null  object
 15  revenue                45460 non-null  float64
 16  runtime                45203 non-null  float64
 17  spoken_languages       45460 non-null  object
 18  status                 45379 non-null  object
 19  tagline                20412 non-null  object
 20  title                  45460 non-null  object
 21  video                  45460 non-null  object
 22  vote_average           45460 non-null  float64
 23  vote_count             45460 non-null  float64
dtypes: float64(4), object(20)
memory usage: 8.3+ MB

In [546]:
df.describe()

            revenue  runtime  vote_average  vote_count
count      45460.00 45203.00      45460.00    45460.00
mean    11209348.54    94.13          5.62      109.90
std     64332246.74    38.41          1.92      491.31
min            0.00     0.00          0.00        0.00
25%            0.00    85.00          5.00        3.00
50%            0.00    95.00          6.00       10.00
75%            0.00   107.00          6.80       34.00
max   2787965087.00  1256.00         10.00    14075.00

## Dropping irrelevant Columns

#### __Drop__ the irrelevant columns.

In [547]:
irr_columns = ['adult', 'imdb_id', 'original_title', 'video','homepage']

In [548]:
df[irr_columns]

,adult,imdb_id,original_title,video,homepage
0,False,tt0114709,Toy Story,False,http://toystory.disney.com/toy-story
1,False,tt0113497,Jumanji,False,NaN
2,False,tt0113228,Grumpier Old Men,False,NaN
3,False,tt0114885,Waiting to Exhale,False,NaN
4,False,tt0113041,Father of the Bride Part II,False,NaN
...,...,...,...,...,...
45461,False,tt6209470,رگ خواب,False,http://www.imdb.com/title/tt6209470/
45462,False,tt2028550,Siglo ng Pagluluwal,False,NaN
45463,False,tt0303758,Betrayal,False,NaN
45464,False,tt0008536,Satana likuyushchiy,False,NaN
45465,False,tt6980792,Queerama,False,NaN

In [549]:
df.drop(labels = irr_columns, axis = 1, inplace = True)

## Handling stringified JSON columns

#### __Evaluate__ Python Expressions in the stringified columns.

In [550]:
stringified_columns =  ["belongs_to_collection", "genres", "production_countries", "production_companies", "spoken_languages"]

In [551]:
df[stringified_columns]

,belongs_to_collection,genres,production_countries,production_companies,spoken_languages
0,"{'id': 10194, 'name': 'Toy Story Collection', ...","[{'id': 16, 'name': 'Animation'}, {'id': 35, '...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'iso_639_1': 'en', 'name': 'English'}]"
1,NaN,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'iso_639_1': 'en', 'name': 'English'}, {'iso..."
2,"{'id': 119050, 'name': 'Grumpy Old Men Collect...","[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'name': 'Warner Bros.', 'id': 6194}, {'name'...","[{'iso_639_1': 'en', 'name': 'English'}]"
3,NaN,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...","[{'iso_3166_1': 'US', 'name': 'United States o...",[{'name': 'Twentieth Century Fox Film Corporat...,"[{'iso_639_1': 'en', 'name': 'English'}]"
4,"{'id': 96871, 'name': 'Father of the Bride Col...","[{'id': 35, 'name': 'Comedy'}]","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'name': 'Sandollar Productions', 'id': 5842}...","[{'iso_639_1': 'en', 'name': 'English'}]"
...,...,...,...,...,...
45461,NaN,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...","[{'iso_3166_1': 'IR', 'name': 'Iran'}]",[],"[{'iso_639_1': 'fa', 'name': 'فارسی'}]"
45462,NaN,"[{'id': 18, 'name': 'Drama'}]","[{'iso_3166_1': 'PH', 'name': 'Philippines'}]","[{'name': 'Sine Olivia', 'id': 19653}]","[{'iso_639_1': 'tl', 'name': ''}]"
45463,NaN,"[{'id': 28, 'name': 'Action'}, {'id': 18, 'nam...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'name': 'American World Pictures', 'id': 6165}]","[{'iso_639_1': 'en', 'name': 'English'}]"
45464,NaN,[],"[{'iso_3166_1': 'RU', 'name': 'Russia'}]","[{'name': 'Yermoliev', 'id': 88753}]",[]
45465,NaN,[],"[{'iso_3166_1': 'GB', 'name': 'United Kingdom'}]",[],"[{'iso_639_1': 'en', 'name': 'English'}]"

In [552]:
import ast

In [553]:
for column in stringified_columns:
    df[column] = df[column].apply(lambda x: ast.literal_eval(x) if isinstance(x, str) else np.nan)

## Flattening nested Columns

#### __Extract__ specific informations from column and override it.

In [554]:
df.belongs_to_collection.loc[0]

{'id': 10194,
 'name': 'Toy Story Collection',
 'poster_path': '/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg',
 'backdrop_path': '/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg'}

In [555]:
df.belongs_to_collection = df.belongs_to_collection.apply(lambda x: x['name'] if isinstance(x, dict) else np.nan)

In [556]:
df.belongs_to_collection

0                  Toy Story Collection
1                                   NaN
2             Grumpy Old Men Collection
3                                   NaN
4        Father of the Bride Collection
                      ...
45461                               NaN
45462                               NaN
45463                               NaN
45464                               NaN
45465                               NaN
Name: belongs_to_collection, Length: 45466, dtype: object

In [557]:
df.belongs_to_collection.value_counts(dropna = False)

NaN                                     40975
The Bowery Boys                            29
Totò Collection                            27
Zatôichi: The Blind Swordsman              26
James Bond Collection                      26
                                        ...
The 1997 Trilogy                            1
Puss 'n Boots Collection                    1
Göta kanal collection                       1
Tomtar och Trolltyg Collection              1
The Bride with White Hair Collection        1
Name: belongs_to_collection, Length: 1696, dtype: int64

In [558]:
df.genres.loc[0]

[{'id': 16, 'name': 'Animation'},
 {'id': 35, 'name': 'Comedy'},
 {'id': 10751, 'name': 'Family'}]

In [559]:
df.genres = df.genres.apply(lambda x: "|".join(i['name'] for i in x) if isinstance(x, list) else np.nan)

In [560]:
df.genres

0         Animation|Comedy|Family
1        Adventure|Fantasy|Family
2                  Romance|Comedy
3            Comedy|Drama|Romance
4                          Comedy
                   ...
45461                Drama|Family
45462                       Drama
45463       Action|Drama|Thriller
45464
45465
Name: genres, Length: 45466, dtype: object

In [561]:
df.genres.value_counts(dropna = False)

Drama                                           5000
Comedy                                          3621
Documentary                                     2723
                                                2442
Drama|Romance                                   1301
                                                ...
Drama|Horror|Comedy|Thriller|Science Fiction       1
Drama|Horror|Crime|Thriller|History                1
Action|Western|Crime                               1
Comedy|Thriller|Mystery|Romance|Foreign            1
Action|Comedy|Western|Romance                      1
Name: genres, Length: 4069, dtype: int64

In [562]:
df.genres.replace(to_replace = "", value = np.nan, inplace = True )

In [563]:
df.genres.value_counts(dropna = False)

Drama                                            5000
Comedy                                           3621
Documentary                                      2723
NaN                                              2442
Drama|Romance                                    1301
                                                 ...
Comedy|Thriller|Science Fiction                     1
Fantasy|Drama|Family|Adventure|Romance              1
Mystery|Science Fiction|Horror|Fantasy              1
Action|Adventure|Comedy|Drama|Fantasy|Romance       1
Action|Comedy|Western|Romance                       1
Name: genres, Length: 4069, dtype: int64

In [564]:
df.spoken_languages.loc[0]

[{'iso_639_1': 'en', 'name': 'English'}]

In [565]:
df.spoken_languages = df.spoken_languages.apply(lambda x: "|".join(i['name'] for i in x) if isinstance(x, list) else np.nan)

In [566]:
df.spoken_languages

0                 English
1        English|Français
2                 English
3                 English
4                 English
               ...
45461               فارسی
45462
45463             English
45464
45465             English
Name: spoken_languages, Length: 45466, dtype: object

In [567]:
df.spoken_languages.value_counts(dropna = False)

English                                             22395
                                                     3952
Français                                             1853
日本語                                                  1289
Italiano                                             1218
                                                    ...
Bahasa indonesia|Nederlands                             1
shqip|Srpski                                            1
Bosanski|Hrvatski|Srpski||Slovenščina                   1
Afrikaans||||isiZulu|English                            1
svenska|Deutsch|English|Español|Français|Pусский        1
Name: spoken_languages, Length: 1843, dtype: int64

In [568]:
df.spoken_languages.replace(to_replace = "", value = np.nan, inplace = True)

In [569]:
df.spoken_languages.value_counts(dropna = False)

English                                         22395
NaN                                              3958
Français                                         1853
日本語                                              1289
Italiano                                         1218
                                                ...
Bahasa indonesia|Nederlands                         1
shqip|Srpski                                        1
Bosanski|Hrvatski|Srpski||Slovenščina               1
Afrikaans||||isiZulu|English                        1
Français|English|Norsk|Português|ภาษาไทย|普通话        1
Name: spoken_languages, Length: 1842, dtype: int64

In [570]:
df.production_countries.loc[0]

[{'iso_3166_1': 'US', 'name': 'United States of America'}]

In [571]:
df.production_countries = df.production_countries.apply(lambda x: "|".join(i['name'] for i in x) if isinstance(x, list) else np.nan)

In [572]:
df.production_countries

0        United States of America
1        United States of America
2        United States of America
3        United States of America
4        United States of America
                   ...
45461                        Iran
45462                 Philippines
45463    United States of America
45464                      Russia
45465              United Kingdom
Name: production_countries, Length: 45466, dtype: object

In [573]:
df.production_countries.value_counts(dropna = False)

United States of America                                       17851
                                                                6282
United Kingdom                                                  2238
France                                                          1654
Japan                                                           1356
                                                               ...
Belgium|Finland                                                    1
Australia|New Zealand|United Kingdom                               1
United States of America|Nicaragua|France                          1
Netherlands|United Kingdom|United States of America|Germany        1
China|Hong Kong|South Korea                                        1
Name: production_countries, Length: 2391, dtype: int64

In [574]:
df.production_countries.replace(to_replace = "", value = np.nan, inplace = True)

In [575]:
df.production_countries.value_counts(dropna = False)

United States of America            17851
NaN                                  6288
United Kingdom                       2238
France                               1654
Japan                                1356
                                    ...
Chile|Spain                             1
Argentina|Spain|France|Italy            1
New Zealand|Singapore                   1
France|United Kingdom|Luxembourg        1
China|Hong Kong|South Korea             1
Name: production_countries, Length: 2390, dtype: int64

In [576]:
df.production_companies.loc[0]

[{'name': 'Pixar Animation Studios', 'id': 3}]

In [577]:
df.production_companies = df.production_companies.apply(lambda x: "|".join(i['name'] for i in x) if isinstance(x, list) else np.nan)

In [578]:
df.production_companies

0                                  Pixar Animation Studios
1        TriStar Pictures|Teitler Film|Interscope Commu...
2                              Warner Bros.|Lancaster Gate
3                   Twentieth Century Fox Film Corporation
4                Sandollar Productions|Touchstone Pictures
                               ...
45461
45462                                          Sine Olivia
45463                              American World Pictures
45464                                            Yermoliev
45465
Name: production_companies, Length: 45466, dtype: object

In [579]:
df.production_companies.value_counts(dropna = False).head(10)

                                          11875
Metro-Goldwyn-Mayer (MGM)                   742
Warner Bros.                                540
Paramount Pictures                          505
Twentieth Century Fox Film Corporation      439
Universal Pictures                          320
RKO Radio Pictures                          247
Columbia Pictures Corporation               207
Columbia Pictures                           146
Mosfilm                                     145
Name: production_companies, dtype: int64

In [580]:
df.production_companies.replace(to_replace = "", value = np.nan, inplace = True)

In [581]:
df.production_companies.value_counts(dropna = False).head(10)

NaN                                       11881
Metro-Goldwyn-Mayer (MGM)                   742
Warner Bros.                                540
Paramount Pictures                          505
Twentieth Century Fox Film Corporation      439
Universal Pictures                          320
RKO Radio Pictures                          247
Columbia Pictures Corporation               207
Columbia Pictures                           146
Mosfilm                                     145
Name: production_companies, dtype: int64

## Cleaning Numerical Columns

#### __Convert__ the datatype in the columns __"budget"__, __"id"__ and __"popularity"__ __to numeric__. Set invalid values as NaN.

In [582]:
to_numeric = ["budget", "id","popularity"]

In [583]:
for column in to_numeric:
    df[column] = pd.to_numeric(df[column], errors = 'coerce')

In [584]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   belongs_to_collection  4491 non-null   object
 1   budget                 45463 non-null  float64
 2   genres                 43024 non-null  object
 3   id                     45463 non-null  float64
 4   original_language      45455 non-null  object
 5   overview               44512 non-null  object
 6   popularity             45460 non-null  float64
 7   poster_path            45080 non-null  object
 8   production_companies   33585 non-null  object
 9   production_countries   39178 non-null  object
 10  release_date           45379 non-null  object
 11  revenue                45460 non-null  float64
 12  runtime                45203 non-null  float64
 13  spoken_languages       41508 non-null  object
 14  status                 45379 non-null  object
 15  tagline                20412 non-null  object
 16  title                  45460 non-null  object
 17  vote_average           45460 non-null  float64
 18  vote_count             45460 non-null  float64
dtypes: float64(7), object(12)
memory usage: 6.6+ MB

####  __Analyze__ the columns __"budget"__ and __"revenue"__ and __"runtime"__.  Analyze movies with a budget/revenue/runtime of 0.

In [585]:
df.budget.value_counts()

0.00           36573
5000000.00       286
10000000.00      259
20000000.00      243
2000000.00       242
               ...
2115000.00         1
1590000.00         1
1978000.00         1
1182273.00         1
2135161.00         1
Name: budget, Length: 1223, dtype: int64

In [586]:
df.budget = df.budget.divide(1000000)

In [587]:
df.budget = df.budget.replace(to_replace = 0, value = np.nan)

In [588]:
df.budget.value_counts()

5.00     286
10.00    259
20.00    243
2.00     242
15.00    226
        ...
82.50      1
0.00       1
2.09       1
2.24       1
0.67       1
Name: budget, Length: 1222, dtype: int64

In [589]:
df.revenue.value_counts()

0.00           38052
12000000.00       20
11000000.00       19
10000000.00       19
2000000.00        18
               ...
31554855.00        1
9627492.00         1
30822861.00        1
13960203.00        1
38702310.00        1
Name: revenue, Length: 6863, dtype: int64

In [590]:
df.revenue = df.revenue.divide(1000000)

In [591]:
df.revenue = df.revenue.replace(to_replace = 0, value = np.nan)

In [592]:
df.revenue.value_counts()

12.00     20
11.00     19
10.00     19
2.00      18
6.00      17
          ..
74.13      1
46.24      1
0.27       1
1.31       1
186.88     1
Name: revenue, Length: 6862, dtype: int64

In [593]:
df.runtime.value_counts()

90.00     2556
0.00      1558
100.00    1470
95.00     1412
93.00     1214
          ...
705.00       1
338.00       1
551.00       1
299.00       1
501.00       1
Name: runtime, Length: 353, dtype: int64

In [594]:
df.runtime = df.runtime.replace(to_replace = 0, value = np.nan)

In [595]:
df.runtime.value_counts(dropna = False)

90.00     2556
NaN       1821
100.00    1470
95.00     1412
93.00     1214
          ...
705.00       1
338.00       1
551.00       1
299.00       1
501.00       1
Name: runtime, Length: 353, dtype: int64

#### The columns "budget" and "revenue" shall show values in Million USD.

In [596]:
df.rename(columns = {'revenue': 'revenue_musd', 'budget': 'budget_musd'}, inplace = True)

#### __Analyze__ movies with a __vote_count of 0__.

In [597]:
df[['vote_count','vote_average']]

       vote_count  vote_average
0         5415.00          7.70
1         2413.00          6.90
2           92.00          6.50
3           34.00          6.10
4          173.00          5.70
...           ...           ...
45461        1.00          4.00
45462        3.00          9.00
45463        6.00          3.80
45464        0.00          0.00
45465        0.00          0.00

[45466 rows x 2 columns]

In [598]:
df.loc[df.vote_count ==0 , 'vote_average']

83      0.00
107     0.00
126     0.00
132     0.00
137     0.00
        ...
45432   0.00
45434   0.00
45452   0.00
45464   0.00
45465   0.00
Name: vote_average, Length: 2899, dtype: float64

In [599]:
df.loc[df.vote_count ==0 , 'vote_average'] = np.nan

In [600]:
df.loc[df.vote_count ==0 , 'vote_average']

83      NaN
107     NaN
126     NaN
132     NaN
137     NaN
         ..
45432   NaN
45434   NaN
45452   NaN
45464   NaN
45465   NaN
Name: vote_average, Length: 2899, dtype: float64

In [601]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   belongs_to_collection  4491 non-null   object
 1   budget_musd            8890 non-null   float64
 2   genres                 43024 non-null  object
 3   id                     45463 non-null  float64
 4   original_language      45455 non-null  object
 5   overview               44512 non-null  object
 6   popularity             45460 non-null  float64
 7   poster_path            45080 non-null  object
 8   production_companies   33585 non-null  object
 9   production_countries   39178 non-null  object
 10  release_date           45379 non-null  object
 11  revenue_musd           7408 non-null   float64
 12  runtime                43645 non-null  float64
 13  spoken_languages       41508 non-null  object
 14  status                 45379 non-null  object
 15  tagline                20412 non-null  object
 16  title                  45460 non-null  object
 17  vote_average           42561 non-null  float64
 18  vote_count             45460 non-null  float64
dtypes: float64(7), object(12)
memory usage: 6.6+ MB

## Cleaning DateTime Columns

#### __Convert__ the datatype in the column __"release_date"__ __to datetime__. Set invalid values as NaN.

In [602]:
df.release_date

0        1995-10-30
1        1995-12-15
2        1995-12-22
3        1995-12-22
4        1995-02-10
            ...
45461           NaN
45462    2011-11-17
45463    2003-08-01
45464    1917-10-21
45465    2017-06-09
Name: release_date, Length: 45466, dtype: object

In [603]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   belongs_to_collection  4491 non-null   object
 1   budget_musd            8890 non-null   float64
 2   genres                 43024 non-null  object
 3   id                     45463 non-null  float64
 4   original_language      45455 non-null  object
 5   overview               44512 non-null  object
 6   popularity             45460 non-null  float64
 7   poster_path            45080 non-null  object
 8   production_companies   33585 non-null  object
 9   production_countries   39178 non-null  object
 10  release_date           45379 non-null  object
 11  revenue_musd           7408 non-null   float64
 12  runtime                43645 non-null  float64
 13  spoken_languages       41508 non-null  object
 14  status                 45379 non-null  object
 15  tagline                20412 non-null  object
 16  title                  45460 non-null  object
 17  vote_average           42561 non-null  float64
 18  vote_count             45460 non-null  float64
dtypes: float64(7), object(12)
memory usage: 6.6+ MB

In [604]:
df.release_date = pd.to_datetime(df.release_date, errors = 'coerce')

In [605]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   belongs_to_collection  4491 non-null   object
 1   budget_musd            8890 non-null   float64
 2   genres                 43024 non-null  object
 3   id                     45463 non-null  float64
 4   original_language      45455 non-null  object
 5   overview               44512 non-null  object
 6   popularity             45460 non-null  float64
 7   poster_path            45080 non-null  object
 8   production_companies   33585 non-null  object
 9   production_countries   39178 non-null  object
 10  release_date           45376 non-null  datetime64[ns]
 11  revenue_musd           7408 non-null   float64
 12  runtime                43645 non-null  float64
 13  spoken_languages       41508 non-null  object
 14  status                 45379 non-null  object
 15  tagline                20412 non-null  object
 16  title                  45460 non-null  object
 17  vote_average           42561 non-null  float64
 18  vote_count             45460 non-null  float64
dtypes: datetime64[ns](1), float64(7), object(11)
memory usage: 6.6+ MB

In [606]:
df.release_date.value_counts(dropna = False)

2008-01-01    136
2009-01-01    121
2007-01-01    118
2005-01-01    111
2006-01-01    101
             ...
1993-05-05      1
1951-02-22      1
1913-10-27      1
1955-02-23      1
1949-10-01      1
Name: release_date, Length: 17334, dtype: int64

## Cleaning Text / String Columns

#### __Analyze__ the text columns "overview" and "tagline".

In [607]:
df.overview

0        Led by Woody, Andy's toys live happily in his ...
1        When siblings Judy and Peter discover an encha...
2        A family wedding reignites the ancient feud be...
3        Cheated on, mistreated and stepped on, the wom...
4        Just when George Banks has recovered from his ...
                               ...
45461          Rising and falling between a man and woman.
45462    An artist struggles to finish his work while a...
45463    When one of her hits goes wrong, a professiona...
45464    In a small town live two brothers, one a minis...
45465    50 years after decriminalisation of homosexual...
Name: overview, Length: 45466, dtype: object

In [608]:
df.overview.value_counts(dropna = False)

NaN                                                                                                                                                                                                                                                                                                                                                                            954
No overview found.                                                                                                                                                                                                                                                                                                                                                             133
No Overview                                                                                                                                                                                                                                                                                                                                                                      7
                                                                                                                                                                                                                                                                                                                                                                                 5
A few funny little novels about different aspects of life.                                                                                                                                                                                                                                                                                                                       3
                                                                                                                                                                                                                                                                                                                                                                              ...
Roger is a foster child whose irresponsible father promises to get his act together when Roger's favourite baseball team, the California Angels, wins the pennant. The problem is that the Angels are in last place, so Roger prays for help to turn the team around. Sure enough, his prayers are answered in the form of angel Al.                                             1
Small time crooksters Nick and Charlie have an elaborate plan to rob an exclusive jewelers store. Using a variety of disguises and posing as rich old men and women they begin the set-up, but then Nick falls for the owner of a neighboring antique store and things get a little complicated.                                                                                 1
A dark comedy about a murder and its consequences presented in a backwards manner, where death is actually a rebirth. The film starts with an "execution" of the main protagonist and goes back to explore his previous actions and motivations.                                                                                                                                 1
Each year, 60,000 people from around the globe gather in a dusty windswept Nevada desert to build a temporary city, collaborating on large-scale art and partying for a week before burning a giant effigy in a ritual frenzy. Spark takes a peek behind the curtain with Burning Man organizers and participants, revealing a year of unprecedented challenges and growth.      1
Lu and Feng are a devoted couple forced to separate when Lu is arrested and sent to a labor camp as a political prisoner during the Cultural Revolution. He finally returns home only to find that his beloved wife no longer remembers him.                                                                                                                                     1
Name: overview, Length: 44308, dtype: int64

In [609]:
df.overview.replace(to_replace = 'No overview found.', value = np.nan, inplace = True)

In [610]:
df.overview.replace(to_replace = 'No Overview', value = np.nan, inplace = True)

In [611]:
df.overview.replace(to_replace = '', value = np.nan, inplace = True)

In [612]:
df.overview.replace(to_replace = ' ', value = np.nan, inplace = True)

In [613]:
df.overview.replace(to_replace = 'Released', value = np.nan, inplace = True)

In [614]:
df.overview.replace(to_replace = 'No movie overview available.', value = np.nan, inplace = True)

In [615]:
df.overview.value_counts(dropna = False)

NaN                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               1105
King Lear, old and tired, divides his kingdom among his daughters, giving great importance to their protestations of love for him. When Cordelia, youngest and most honest, refuses to idly flatter the old man in return for favor, he banishes her and turns for support to his remaining daughters. But Goneril and Regan have no love for him and instead plot to take all his power from him. In a parallel, Lear's loyal courtier Gloucester favors his illegitimate son Edmund after being told lies about his faithful son Edgar. Madness and tragedy befall both ill-starred fathers.       3
A few funny little novels about different aspects of life.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           3
Recovering from a nail gun shot to the head and 13 months of coma, doctor Pekka Valinta starts to unravel the mystery of his past, still suffering from total amnesia.                                                                                                                                                                                                                                                                                                                                                                                                                               3
Adaptation of the Jane Austen novel.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 3
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  ...
Phil, Melissa, Mitch, Mary, and Vinnie are high school friends, who unwittingly raise the dead on Halloween night. Once the dead have returned, Pitchford Cove will never be the same again....or will it?                                                                                                                                                                                                                                                                                                                                                                                           1
Roger is a foster child whose irresponsible father promises to get his act together when Roger's favourite baseball team, the California Angels, wins the pennant. The problem is that the Angels are in last place, so Roger prays for help to turn the team around. Sure enough, his prayers are answered in the form of angel Al.                                                                                                                                                                                                                                                                 1
Small time crooksters Nick and Charlie have an elaborate plan to rob an exclusive jewelers store. Using a variety of disguises and posing as rich old men and women they begin the set-up, but then Nick falls for the owner of a neighboring antique store and things get a little complicated.                                                                                                                                                                                                                                                                                                     1
A dark comedy about a murder and its consequences presented in a backwards manner, where death is actually a rebirth. The film starts with an "execution" of the main protagonist and goes back to explore his previous actions and motivations.                                                                                                                                                                                                                                                                                                                                                     1
Lu and Feng are a devoted couple forced to separate when Lu is arrested and sent to a labor camp as a political prisoner during the Cultural Revolution. He finally returns home only to find that his beloved wife no longer remembers him.                                                                                                                                                                                                                                                                                                                                                         1
Name: overview, Length: 44303, dtype: int64

In [616]:
df.tagline.value_counts(dropna = False)

NaN                                                     25054
Based on a true story.                                      7
-                                                           4
Be careful what you wish for.                               4
Trust no one.                                               4
                                                        ...
The first film about the NEXT crisis.                       1
The nightmare isn't over!                                   1
If they think they can stop him, they're dead wrong.        1
Superbad. Superdad.                                         1
He fell out of a plane and into their lives.                1
Name: tagline, Length: 20284, dtype: int64

In [617]:
df.tagline.replace(to_replace = '-', value = np.nan, inplace = True)

In [618]:
df.tagline.value_counts(dropna = False)

NaN                                                           25058
Based on a true story.                                            7
Be careful what you wish for.                                     4
Trust no one.                                                     4
Which one is the first to return - memory or the murderer?        3
                                                              ...
The first film about the NEXT crisis.                             1
The nightmare isn't over!                                         1
If they think they can stop him, they're dead wrong.              1
Superbad. Superdad.                                               1
He fell out of a plane and into their lives.                      1
Name: tagline, Length: 20283, dtype: int64

## Removing Duplicates

#### __Identify__ and __remove__ duplicates.

In [619]:
df.id.value_counts()

141971.00    3
265189.00    2
5511.00      2
42495.00     2
119916.00    2
            ..
9737.00      1
38726.00     1
71772.00     1
34935.00     1
226693.00    1
Name: id, Length: 45433, dtype: int64

In [620]:
df.drop_duplicates(subset = 'id', keep = False, inplace =True)

In [621]:
df.id.value_counts()

92771.00     1
37181.00     1
153913.00    1
374614.00    1
310131.00    1
            ..
820.00       1
262.00       1
173914.00    1
110898.00    1
226693.00    1
Name: id, Length: 45404, dtype: int64

## Handling Missing Values & Removing Observations

####  __Drop__ all rows/movies with unknown __id__ or __title__.

In [622]:
id_mask = df.id.isna() | df.title.isna()

In [623]:
df.loc[id_mask]

,belongs_to_collection,budget_musd,genres,id,original_language,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue_musd,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
19729,NaN,NaN,Action|Thriller|Drama,82663.00,en,British soldiers force a recently captured IRA...,NaN,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29502,Mardock Scramble Collection,NaN,Animation|Science Fiction,122662.00,ja,Third film of the Mardock Scramble series.,NaN,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35586,NaN,NaN,TV Movie|Action|Horror|Science Fiction,249260.00,en,A group of skiers are terrorized during spring...,NaN,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [624]:
df.dropna(subset = ['id','title'], inplace = True)

#### __Keep__ only those rows/movies in the df with __10 or more non-NaN__ values.

In [625]:
df.dropna(thresh = 10, inplace = True)

In [626]:
df.id = df.id.astype('int')

## Final (Cleaning) Steps

#### __Keep__ only those rows/movies in the df with __status "Released"__. Then __drop__ the column "status".

In [627]:
df.status.value_counts()

Released           44664
Rumored              225
Post Production       98
In Production         20
Planned               15
Canceled               2
Name: status, dtype: int64

In [628]:
status_mask = df.status == 'Released'

In [629]:
df = df[status_mask].copy()

In [630]:
df.drop(columns = 'status', inplace = True)

#### Change the order of columns.

In [631]:
col = ["id", "title", "tagline", "release_date", "genres", "belongs_to_collection", 
"original_language", "budget_musd", "revenue_musd", "production_companies",
"production_countries", "vote_count", "vote_average", "popularity", "runtime",
"overview", "spoken_languages", "poster_path"]

#### __Reset__ the Index and create a __RangeIndex__.

In [632]:
df = df.loc[:,col]

In [633]:
df.reset_index(inplace = True, drop = True)

In [634]:
df.head()

,id,title,tagline,release_date,genres,belongs_to_collection,original_language,budget_musd,revenue_musd,production_companies,production_countries,vote_count,vote_average,popularity,runtime,overview,spoken_languages,poster_path
0,862,Toy Story,NaN,1995-10-30,Animation|Comedy|Family,Toy Story Collection,en,30.00,373.55,Pixar Animation Studios,United States of America,5415.00,7.70,21.95,81.00,"Led by Woody, Andy's toys live happily in his ...",English,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg
1,8844,Jumanji,Roll the dice and unleash the excitement!,1995-12-15,Adventure|Fantasy|Family,NaN,en,65.00,262.80,TriStar Pictures|Teitler Film|Interscope Commu...,United States of America,2413.00,6.90,17.02,104.00,When siblings Judy and Peter discover an encha...,English|Français,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg
2,15602,Grumpier Old Men,Still Yelling. Still Fighting. Still Ready for...,1995-12-22,Romance|Comedy,Grumpy Old Men Collection,en,NaN,NaN,Warner Bros.|Lancaster Gate,United States of America,92.00,6.50,11.71,101.00,A family wedding reignites the ancient feud be...,English,/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg
3,31357,Waiting to Exhale,Friends are the people who let you be yourself...,1995-12-22,Comedy|Drama|Romance,NaN,en,16.00,81.45,Twentieth Century Fox Film Corporation,United States of America,34.00,6.10,3.86,127.00,"Cheated on, mistreated and stepped on, the wom...",English,/16XOMpEaLWkrcPqSQqhTmeJuqQl.jpg
4,11862,Father of the Bride Part II,Just When His World Is Back To Normal... He's ...,1995-02-10,Comedy,Father of the Bride Collection,en,NaN,76.58,Sandollar Productions|Touchstone Pictures,United States of America,173.00,5.70,8.39,106.00,Just when George Banks has recovered from his ...,English,/e64sOI48hQXyru7naBFyssKFxVd.jpg

#### __Save__ the cleaned dataset in a __csv-file__.

In [635]:
df.to_csv('movies_clean.csv')